grevaillot/svd_tools/headers/STM32F103xx/fsmc.h
#define FSMC_BTR2_ADDHLD_SHIFT		4
#define FSMC_BTR2_ADDHLD_MASK		0x0f
/** @defgroup fsmc_btr2_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FSMC_BTR2_ADDSET_SHIFT		0
#define FSMC_BTR2_ADDSET_MASK		0x0f
/** @defgroup fsmc_btr2_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_bcr3 BCR3 SRAM/NOR-Flash chip-select control register 3
@{*/

/** FSMC_BCR3_CBURSTRW CBURSTRW **/
#define FSMC_BCR3_CBURSTRW		(1 << 19)
/** FSMC_BCR3_ASYNCWAIT ASYNCWAIT **/
#define FSMC_BCR3_ASYNCWAIT		(1 << 15)
/** FSMC_BCR3_EXTMOD EXTMOD **/
#define FSMC_BCR3_EXTMOD		(1 << 14)
/** FSMC_BCR3_WAITEN WAITEN **/
#define FSMC_BCR3_WAITEN		(1 << 13)
/** FSMC_BCR3_WREN WREN **/
#define FSMC_BCR3_WREN		(1 << 12)
/** FSMC_BCR3_WAITCFG WAITCFG **/
#define FSMC_BCR3_WAITCFG		(1 << 11)
/** FSMC_BCR3_WRAPMOD WRAPMOD **/
#define FSMC_BCR3_WRAPMOD		(1 << 10)
/** FSMC_BCR3_WAITPOL WAITPOL **/
#define FSMC_BCR3_WAITPOL		(1 << 9)
/** FSMC_BCR3_BURSTEN BURSTEN **/
#define FSMC_BCR3_BURSTEN		(1 << 8)
/** FSMC_BCR3_FACCEN FACCEN **/
#define FSMC_BCR3_FACCEN		(1 << 6)

#define FSMC_BCR3_MWID_SHIFT		4
#define FSMC_BCR3_MWID_MASK		0x03
/** @defgroup fsmc_bcr3_mwid MWID MWID
@{*/
/**@}*/


#define FSMC_BCR3_MTYP_SHIFT		2
#define FSMC_BCR3_MTYP_MASK		0x03
/** @defgroup fsmc_bcr3_mtyp MTYP MTYP
@{*/
/**@}*/

/** FSMC_BCR3_MUXEN MUXEN **/
#define FSMC_BCR3_MUXEN		(1 << 1)
/** FSMC_BCR3_MBKEN MBKEN **/
#define FSMC_BCR3_MBKEN		(1 << 0)

/**@}*/

/** @defgroup fsmc_btr3 BTR3 SRAM/NOR-Flash chip-select timing register 3
@{*/


#define FSMC_BTR3_ACCMOD_SHIFT		28
#define FSMC_BTR3_ACCMOD_MASK		0x03
/** @defgroup fsmc_btr3_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FSMC_BTR3_DATLAT_SHIFT		24
#define FSMC_BTR3_DATLAT_MASK		0x0f
/** @defgroup fsmc_btr3_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FSMC_BTR3_CLKDIV_SHIFT		20
#define FSMC_BTR3_CLKDIV_MASK		0x0f
/** @defgroup fsmc_btr3_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FSMC_BTR3_BUSTURN_SHIFT		16
#define FSMC_BTR3_BUSTURN_MASK		0x0f
/** @defgroup fsmc_btr3_busturn BUSTURN BUSTURN
@{*/
/**@}*/


#define FSMC_BTR3_DATAST_SHIFT		8
#define FSMC_BTR3_DATAST_MASK		0xff
/** @defgroup fsmc_btr3_datast DATAST DATAST
@{*/
/**@}*/


#define FSMC_BTR3_ADDHLD_SHIFT		4
#define FSMC_BTR3_ADDHLD_MASK		0x0f
/** @defgroup fsmc_btr3_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FSMC_BTR3_ADDSET_SHIFT		0
#define FSMC_BTR3_ADDSET_MASK		0x0f
/** @defgroup fsmc_btr3_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_bcr4 BCR4 SRAM/NOR-Flash chip-select control register 4
@{*/

/** FSMC_BCR4_CBURSTRW CBURSTRW **/
#define FSMC_BCR4_CBURSTRW		(1 << 19)
/** FSMC_BCR4_ASYNCWAIT ASYNCWAIT **/
#define FSMC_BCR4_ASYNCWAIT		(1 << 15)
/** FSMC_BCR4_EXTMOD EXTMOD **/
#define FSMC_BCR4_EXTMOD		(1 << 14)
/** FSMC_BCR4_WAITEN WAITEN **/
#define FSMC_BCR4_WAITEN		(1 << 13)
/** FSMC_BCR4_WREN WREN **/
#define FSMC_BCR4_WREN		(1 << 12)
/** FSMC_BCR4_WAITCFG WAITCFG **/
#define FSMC_BCR4_WAITCFG		(1 << 11)
/** FSMC_BCR4_WRAPMOD WRAPMOD **/
#define FSMC_BCR4_WRAPMOD		(1 << 10)
/** FSMC_BCR4_WAITPOL WAITPOL **/
#define FSMC_BCR4_WAITPOL		(1 << 9)
/** FSMC_BCR4_BURSTEN BURSTEN **/
#define FSMC_BCR4_BURSTEN		(1 << 8)
/** FSMC_BCR4_FACCEN FACCEN **/
#define FSMC_BCR4_FACCEN		(1 << 6)

#define FSMC_BCR4_MWID_SHIFT		4
#define FSMC_BCR4_MWID_MASK		0x03
/** @defgroup fsmc_bcr4_mwid MWID MWID
@{*/
/**@}*/


#define FSMC_BCR4_MTYP_SHIFT		2
#define FSMC_BCR4_MTYP_MASK		0x03
/** @defgroup fsmc_bcr4_mtyp MTYP MTYP
@{*/
/**@}*/

/** FSMC_BCR4_MUXEN MUXEN **/
#define FSMC_BCR4_MUXEN		(1 << 1)
/** FSMC_BCR4_MBKEN MBKEN **/
#define FSMC_BCR4_MBKEN		(1 << 0)

/**@}*/

/** @defgroup fsmc_btr4 BTR4 SRAM/NOR-Flash chip-select timing register 4
@{*/


#define FSMC_BTR4_ACCMOD_SHIFT		28
#define FSMC_BTR4_ACCMOD_MASK		0x03
/** @defgroup fsmc_btr4_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FSMC_BTR4_DATLAT_SHIFT		24
#define FSMC_BTR4_DATLAT_MASK		0x0f
/** @defgroup fsmc_btr4_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FSMC_BTR4_CLKDIV_SHIFT		20
#define FSMC_BTR4_CLKDIV_MASK		0x0f
/** @defgroup fsmc_btr4_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FSMC_BTR4_BUSTURN_SHIFT		16
#define FSMC_BTR4_BUSTURN_MASK		0x0f
/** @defgroup fsmc_btr4_busturn BUSTURN BUSTURN
@{*/
/**@}*/


#define FSMC_BTR4_DATAST_SHIFT		8
#define FSMC_BTR4_DATAST_MASK		0xff
/** @defgroup fsmc_btr4_datast DATAST DATAST
@{*/
/**@}*/


#define FSMC_BTR4_ADDHLD_SHIFT		4
#define FSMC_BTR4_ADDHLD_MASK		0x0f
/** @defgroup fsmc_btr4_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FSMC_BTR4_ADDSET_SHIFT		0
#define FSMC_BTR4_ADDSET_MASK		0x0f
/** @defgroup fsmc_btr4_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_pcr2 PCR2 PC Card/NAND Flash control register 2
@{*/


#define FSMC_PCR2_ECCPS_SHIFT		17
#define FSMC_PCR2_ECCPS_MASK		0x07
/** @defgroup fsmc_pcr2_eccps ECCPS ECCPS
@{*/
/**@}*/


#define FSMC_PCR2_TAR_SHIFT		13
#define FSMC_PCR2_TAR_MASK		0x0f
/** @defgroup fsmc_pcr2_tar TAR TAR
@{*/
/**@}*/


#define FSMC_PCR2_TCLR_SHIFT		9
#define FSMC_PCR2_TCLR_MASK		0x0f
/** @defgroup fsmc_pcr2_tclr TCLR TCLR
@{*/
/**@}*/

/** FSMC_PCR2_ECCEN ECCEN **/
#define FSMC_PCR2_ECCEN		(1 << 6)

#define FSMC_PCR2_PWID_SHIFT		4
#define FSMC_PCR2_PWID_MASK		0x03
/** @defgroup fsmc_pcr2_pwid PWID PWID
@{*/
/**@}*/

/** FSMC_PCR2_PTYP PTYP **/
#define FSMC_PCR2_PTYP		(1 << 3)
/** FSMC_PCR2_PBKEN PBKEN **/
#define FSMC_PCR2_PBKEN		(1 << 2)
/** FSMC_PCR2_PWAITEN PWAITEN **/
#define FSMC_PCR2_PWAITEN		(1 << 1)

/**@}*/

/** @defgroup fsmc_sr2 SR2 FIFO status and interrupt register 2
@{*/

/** FSMC_SR2_FEMPT FEMPT **/
#define FSMC_SR2_FEMPT		(1 << 6)
/** FSMC_SR2_IFEN IFEN **/
#define FSMC_SR2_IFEN		(1 << 5)
/** FSMC_SR2_ILEN ILEN **/
#define FSMC_SR2_ILEN		(1 << 4)
/** FSMC_SR2_IREN IREN **/
#define FSMC_SR2_IREN		(1 << 3)
/** FSMC_SR2_IFS IFS **/
#define FSMC_SR2_IFS		(1 << 2)
/** FSMC_SR2_ILS ILS **/
#define FSMC_SR2_ILS		(1 << 1)
/** FSMC_SR2_IRS IRS **/
#define FSMC_SR2_IRS		(1 << 0)

/**@}*/

/** @defgroup fsmc_pmem2 PMEM2 Common memory space timing register 2
@{*/


#define FSMC_PMEM2_MEMHIZx_SHIFT		24
#define FSMC_PMEM2_MEMHIZx_MASK		0xff
/** @defgroup fsmc_pmem2_memhizx MEMHIZx MEMHIZx
@{*/
/**@}*/


