grevaillot/svd_tools/headers/STM32F103xx/fsmc.h
#define FSMC_PMEM2_MEMHOLDx_SHIFT		16
#define FSMC_PMEM2_MEMHOLDx_MASK		0xff
/** @defgroup fsmc_pmem2_memholdx MEMHOLDx MEMHOLDx
@{*/
/**@}*/


#define FSMC_PMEM2_MEMWAITx_SHIFT		8
#define FSMC_PMEM2_MEMWAITx_MASK		0xff
/** @defgroup fsmc_pmem2_memwaitx MEMWAITx MEMWAITx
@{*/
/**@}*/


#define FSMC_PMEM2_MEMSETx_SHIFT		0
#define FSMC_PMEM2_MEMSETx_MASK		0xff
/** @defgroup fsmc_pmem2_memsetx MEMSETx MEMSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_patt2 PATT2 Attribute memory space timing register 2
@{*/


#define FSMC_PATT2_ATTHIZx_SHIFT		24
#define FSMC_PATT2_ATTHIZx_MASK		0xff
/** @defgroup fsmc_patt2_atthizx ATTHIZx Attribute memory x databus HiZ time
@{*/
/**@}*/


#define FSMC_PATT2_ATTHOLDx_SHIFT		16
#define FSMC_PATT2_ATTHOLDx_MASK		0xff
/** @defgroup fsmc_patt2_attholdx ATTHOLDx Attribute memory x hold time
@{*/
/**@}*/


#define FSMC_PATT2_ATTWAITx_SHIFT		8
#define FSMC_PATT2_ATTWAITx_MASK		0xff
/** @defgroup fsmc_patt2_attwaitx ATTWAITx Attribute memory x wait time
@{*/
/**@}*/


#define FSMC_PATT2_ATTSETx_SHIFT		0
#define FSMC_PATT2_ATTSETx_MASK		0xff
/** @defgroup fsmc_patt2_attsetx ATTSETx Attribute memory x setup time
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_eccr2 ECCR2 ECC result register 2
@{*/


#define FSMC_ECCR2_ECCx_SHIFT		0
#define FSMC_ECCR2_ECCx_MASK		0xffffffff
/** @defgroup fsmc_eccr2_eccx ECCx ECC result
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_pcr3 PCR3 PC Card/NAND Flash control register 3
@{*/


#define FSMC_PCR3_ECCPS_SHIFT		17
#define FSMC_PCR3_ECCPS_MASK		0x07
/** @defgroup fsmc_pcr3_eccps ECCPS ECCPS
@{*/
/**@}*/


#define FSMC_PCR3_TAR_SHIFT		13
#define FSMC_PCR3_TAR_MASK		0x0f
/** @defgroup fsmc_pcr3_tar TAR TAR
@{*/
/**@}*/


#define FSMC_PCR3_TCLR_SHIFT		9
#define FSMC_PCR3_TCLR_MASK		0x0f
/** @defgroup fsmc_pcr3_tclr TCLR TCLR
@{*/
/**@}*/

/** FSMC_PCR3_ECCEN ECCEN **/
#define FSMC_PCR3_ECCEN		(1 << 6)

#define FSMC_PCR3_PWID_SHIFT		4
#define FSMC_PCR3_PWID_MASK		0x03
/** @defgroup fsmc_pcr3_pwid PWID PWID
@{*/
/**@}*/

/** FSMC_PCR3_PTYP PTYP **/
#define FSMC_PCR3_PTYP		(1 << 3)
/** FSMC_PCR3_PBKEN PBKEN **/
#define FSMC_PCR3_PBKEN		(1 << 2)
/** FSMC_PCR3_PWAITEN PWAITEN **/
#define FSMC_PCR3_PWAITEN		(1 << 1)

/**@}*/

/** @defgroup fsmc_sr3 SR3 FIFO status and interrupt register 3
@{*/

/** FSMC_SR3_FEMPT FEMPT **/
#define FSMC_SR3_FEMPT		(1 << 6)
/** FSMC_SR3_IFEN IFEN **/
#define FSMC_SR3_IFEN		(1 << 5)
/** FSMC_SR3_ILEN ILEN **/
#define FSMC_SR3_ILEN		(1 << 4)
/** FSMC_SR3_IREN IREN **/
#define FSMC_SR3_IREN		(1 << 3)
/** FSMC_SR3_IFS IFS **/
#define FSMC_SR3_IFS		(1 << 2)
/** FSMC_SR3_ILS ILS **/
#define FSMC_SR3_ILS		(1 << 1)
/** FSMC_SR3_IRS IRS **/
#define FSMC_SR3_IRS		(1 << 0)

/**@}*/

/** @defgroup fsmc_pmem3 PMEM3 Common memory space timing register 3
@{*/


#define FSMC_PMEM3_MEMHIZx_SHIFT		24
#define FSMC_PMEM3_MEMHIZx_MASK		0xff
/** @defgroup fsmc_pmem3_memhizx MEMHIZx MEMHIZx
@{*/
/**@}*/


#define FSMC_PMEM3_MEMHOLDx_SHIFT		16
#define FSMC_PMEM3_MEMHOLDx_MASK		0xff
/** @defgroup fsmc_pmem3_memholdx MEMHOLDx MEMHOLDx
@{*/
/**@}*/


#define FSMC_PMEM3_MEMWAITx_SHIFT		8
#define FSMC_PMEM3_MEMWAITx_MASK		0xff
/** @defgroup fsmc_pmem3_memwaitx MEMWAITx MEMWAITx
@{*/
/**@}*/


#define FSMC_PMEM3_MEMSETx_SHIFT		0
#define FSMC_PMEM3_MEMSETx_MASK		0xff
/** @defgroup fsmc_pmem3_memsetx MEMSETx MEMSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_patt3 PATT3 Attribute memory space timing register 3
@{*/


#define FSMC_PATT3_ATTHIZx_SHIFT		24
#define FSMC_PATT3_ATTHIZx_MASK		0xff
/** @defgroup fsmc_patt3_atthizx ATTHIZx ATTHIZx
@{*/
/**@}*/


#define FSMC_PATT3_ATTHOLDx_SHIFT		16
#define FSMC_PATT3_ATTHOLDx_MASK		0xff
/** @defgroup fsmc_patt3_attholdx ATTHOLDx ATTHOLDx
@{*/
/**@}*/


#define FSMC_PATT3_ATTWAITx_SHIFT		8
#define FSMC_PATT3_ATTWAITx_MASK		0xff
/** @defgroup fsmc_patt3_attwaitx ATTWAITx ATTWAITx
@{*/
/**@}*/


#define FSMC_PATT3_ATTSETx_SHIFT		0
#define FSMC_PATT3_ATTSETx_MASK		0xff
/** @defgroup fsmc_patt3_attsetx ATTSETx ATTSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_eccr3 ECCR3 ECC result register 3
@{*/


#define FSMC_ECCR3_ECCx_SHIFT		0
#define FSMC_ECCR3_ECCx_MASK		0xffffffff
/** @defgroup fsmc_eccr3_eccx ECCx ECCx
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_pcr4 PCR4 PC Card/NAND Flash control register 4
@{*/


#define FSMC_PCR4_ECCPS_SHIFT		17
#define FSMC_PCR4_ECCPS_MASK		0x07
/** @defgroup fsmc_pcr4_eccps ECCPS ECCPS
@{*/
/**@}*/


#define FSMC_PCR4_TAR_SHIFT		13
#define FSMC_PCR4_TAR_MASK		0x0f
/** @defgroup fsmc_pcr4_tar TAR TAR
@{*/
/**@}*/


#define FSMC_PCR4_TCLR_SHIFT		9
#define FSMC_PCR4_TCLR_MASK		0x0f
/** @defgroup fsmc_pcr4_tclr TCLR TCLR
@{*/
/**@}*/

/** FSMC_PCR4_ECCEN ECCEN **/
#define FSMC_PCR4_ECCEN		(1 << 6)

#define FSMC_PCR4_PWID_SHIFT		4
#define FSMC_PCR4_PWID_MASK		0x03
/** @defgroup fsmc_pcr4_pwid PWID PWID
@{*/
/**@}*/

/** FSMC_PCR4_PTYP PTYP **/
#define FSMC_PCR4_PTYP		(1 << 3)
/** FSMC_PCR4_PBKEN PBKEN **/
#define FSMC_PCR4_PBKEN		(1 << 2)
/** FSMC_PCR4_PWAITEN PWAITEN **/
#define FSMC_PCR4_PWAITEN		(1 << 1)

/**@}*/

/** @defgroup fsmc_sr4 SR4 FIFO status and interrupt register 4
@{*/

/** FSMC_SR4_FEMPT FEMPT **/
#define FSMC_SR4_FEMPT		(1 << 6)
/** FSMC_SR4_IFEN IFEN **/
#define FSMC_SR4_IFEN		(1 << 5)
/** FSMC_SR4_ILEN ILEN **/
#define FSMC_SR4_ILEN		(1 << 4)
/** FSMC_SR4_IREN IREN **/
#define FSMC_SR4_IREN		(1 << 3)
/** FSMC_SR4_IFS IFS **/
#define FSMC_SR4_IFS		(1 << 2)
/** FSMC_SR4_ILS ILS **/
#define FSMC_SR4_ILS		(1 << 1)
/** FSMC_SR4_IRS IRS **/
#define FSMC_SR4_IRS		(1 << 0)

/**@}*/

/** @defgroup fsmc_pmem4 PMEM4 Common memory space timing register 4
@{*/


#define FSMC_PMEM4_MEMHIZx_SHIFT		24
#define FSMC_PMEM4_MEMHIZx_MASK		0xff
/** @defgroup fsmc_pmem4_memhizx MEMHIZx MEMHIZx
@{*/
/**@}*/


#define FSMC_PMEM4_MEMHOLDx_SHIFT		16
#define FSMC_PMEM4_MEMHOLDx_MASK		0xff
/** @defgroup fsmc_pmem4_memholdx MEMHOLDx MEMHOLDx
@{*/
/**@}*/


#define FSMC_PMEM4_MEMWAITx_SHIFT		8
#define FSMC_PMEM4_MEMWAITx_MASK		0xff
/** @defgroup fsmc_pmem4_memwaitx MEMWAITx MEMWAITx
@{*/
/**@}*/


#define FSMC_PMEM4_MEMSETx_SHIFT		0
#define FSMC_PMEM4_MEMSETx_MASK		0xff
/** @defgroup fsmc_pmem4_memsetx MEMSETx MEMSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_patt4 PATT4 Attribute memory space timing register 4
@{*/


#define FSMC_PATT4_ATTHIZx_SHIFT		24
#define FSMC_PATT4_ATTHIZx_MASK		0xff
/** @defgroup fsmc_patt4_atthizx ATTHIZx ATTHIZx
@{*/
/**@}*/


#define FSMC_PATT4_ATTHOLDx_SHIFT		16
#define FSMC_PATT4_ATTHOLDx_MASK		0xff
/** @defgroup fsmc_patt4_attholdx ATTHOLDx ATTHOLDx
@{*/
/**@}*/


#define FSMC_PATT4_ATTWAITx_SHIFT		8
#define FSMC_PATT4_ATTWAITx_MASK		0xff
/** @defgroup fsmc_patt4_attwaitx ATTWAITx ATTWAITx
@{*/
/**@}*/


#define FSMC_PATT4_ATTSETx_SHIFT		0
#define FSMC_PATT4_ATTSETx_MASK		0xff
/** @defgroup fsmc_patt4_attsetx ATTSETx ATTSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_pio4 PIO4 I/O space timing register 4
@{*/


#define FSMC_PIO4_IOHIZx_SHIFT		24
#define FSMC_PIO4_IOHIZx_MASK		0xff
/** @defgroup fsmc_pio4_iohizx IOHIZx IOHIZx
@{*/
/**@}*/


#define FSMC_PIO4_IOHOLDx_SHIFT		16
#define FSMC_PIO4_IOHOLDx_MASK		0xff
/** @defgroup fsmc_pio4_ioholdx IOHOLDx IOHOLDx
@{*/
/**@}*/


#define FSMC_PIO4_IOWAITx_SHIFT		8
#define FSMC_PIO4_IOWAITx_MASK		0xff
/** @defgroup fsmc_pio4_iowaitx IOWAITx IOWAITx
@{*/
/**@}*/


