grevaillot/svd_tools/headers/STM32F103xx/fsmc.h
#define FSMC_PIO4_IOSETx_SHIFT		0
#define FSMC_PIO4_IOSETx_MASK		0xff
/** @defgroup fsmc_pio4_iosetx IOSETx IOSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_bwtr1 BWTR1 SRAM/NOR-Flash write timing registers 1
@{*/


#define FSMC_BWTR1_ACCMOD_SHIFT		28
#define FSMC_BWTR1_ACCMOD_MASK		0x03
/** @defgroup fsmc_bwtr1_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FSMC_BWTR1_DATLAT_SHIFT		24
#define FSMC_BWTR1_DATLAT_MASK		0x0f
/** @defgroup fsmc_bwtr1_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FSMC_BWTR1_CLKDIV_SHIFT		20
#define FSMC_BWTR1_CLKDIV_MASK		0x0f
/** @defgroup fsmc_bwtr1_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FSMC_BWTR1_DATAST_SHIFT		8
#define FSMC_BWTR1_DATAST_MASK		0xff
/** @defgroup fsmc_bwtr1_datast DATAST DATAST
@{*/
/**@}*/


#define FSMC_BWTR1_ADDHLD_SHIFT		4
#define FSMC_BWTR1_ADDHLD_MASK		0x0f
/** @defgroup fsmc_bwtr1_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FSMC_BWTR1_ADDSET_SHIFT		0
#define FSMC_BWTR1_ADDSET_MASK		0x0f
/** @defgroup fsmc_bwtr1_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_bwtr2 BWTR2 SRAM/NOR-Flash write timing registers 2
@{*/


#define FSMC_BWTR2_ACCMOD_SHIFT		28
#define FSMC_BWTR2_ACCMOD_MASK		0x03
/** @defgroup fsmc_bwtr2_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FSMC_BWTR2_DATLAT_SHIFT		24
#define FSMC_BWTR2_DATLAT_MASK		0x0f
/** @defgroup fsmc_bwtr2_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FSMC_BWTR2_CLKDIV_SHIFT		20
#define FSMC_BWTR2_CLKDIV_MASK		0x0f
/** @defgroup fsmc_bwtr2_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FSMC_BWTR2_DATAST_SHIFT		8
#define FSMC_BWTR2_DATAST_MASK		0xff
/** @defgroup fsmc_bwtr2_datast DATAST DATAST
@{*/
/**@}*/


#define FSMC_BWTR2_ADDHLD_SHIFT		4
#define FSMC_BWTR2_ADDHLD_MASK		0x0f
/** @defgroup fsmc_bwtr2_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FSMC_BWTR2_ADDSET_SHIFT		0
#define FSMC_BWTR2_ADDSET_MASK		0x0f
/** @defgroup fsmc_bwtr2_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_bwtr3 BWTR3 SRAM/NOR-Flash write timing registers 3
@{*/


#define FSMC_BWTR3_ACCMOD_SHIFT		28
#define FSMC_BWTR3_ACCMOD_MASK		0x03
/** @defgroup fsmc_bwtr3_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FSMC_BWTR3_DATLAT_SHIFT		24
#define FSMC_BWTR3_DATLAT_MASK		0x0f
/** @defgroup fsmc_bwtr3_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FSMC_BWTR3_CLKDIV_SHIFT		20
#define FSMC_BWTR3_CLKDIV_MASK		0x0f
/** @defgroup fsmc_bwtr3_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FSMC_BWTR3_DATAST_SHIFT		8
#define FSMC_BWTR3_DATAST_MASK		0xff
/** @defgroup fsmc_bwtr3_datast DATAST DATAST
@{*/
/**@}*/


#define FSMC_BWTR3_ADDHLD_SHIFT		4
#define FSMC_BWTR3_ADDHLD_MASK		0x0f
/** @defgroup fsmc_bwtr3_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FSMC_BWTR3_ADDSET_SHIFT		0
#define FSMC_BWTR3_ADDSET_MASK		0x0f
/** @defgroup fsmc_bwtr3_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fsmc_bwtr4 BWTR4 SRAM/NOR-Flash write timing registers 4
@{*/


#define FSMC_BWTR4_ACCMOD_SHIFT		28
#define FSMC_BWTR4_ACCMOD_MASK		0x03
/** @defgroup fsmc_bwtr4_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FSMC_BWTR4_DATLAT_SHIFT		24
#define FSMC_BWTR4_DATLAT_MASK		0x0f
/** @defgroup fsmc_bwtr4_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FSMC_BWTR4_CLKDIV_SHIFT		20
#define FSMC_BWTR4_CLKDIV_MASK		0x0f
/** @defgroup fsmc_bwtr4_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FSMC_BWTR4_DATAST_SHIFT		8
#define FSMC_BWTR4_DATAST_MASK		0xff
/** @defgroup fsmc_bwtr4_datast DATAST DATAST
@{*/
/**@}*/


#define FSMC_BWTR4_ADDHLD_SHIFT		4
#define FSMC_BWTR4_ADDHLD_MASK		0x0f
/** @defgroup fsmc_bwtr4_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FSMC_BWTR4_ADDSET_SHIFT		0
#define FSMC_BWTR4_ADDSET_MASK		0x0f
/** @defgroup fsmc_bwtr4_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/
